In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Downloading pandas-2.3.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\marre\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp312-cp312-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
    --------------------------------------- 0.3/11.0 MB ? eta -:--:--
    --------------------------------------- 0.3/11.0 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.0 MB 840.2 kB/s eta 0:00:13
   -- ------------------------------------- 0.8/11.0 MB 907.1 kB/s eta 0:00:12
   --- ------------------------------------ 1.0/11.0 MB 883.6 kB/s eta 0:00:12
   --- ------------------------------------ 1.0/11.0 MB 883.6 kB/s eta 0:00:12
   ----- ---------------------------------- 1.6/11.0 MB 1.0 MB/s eta 0:00:10
   ------- -------------------------------- 2.1/11.0 MB 1.2 MB/s eta 0:00:08
   -------- ------------------------------- 2.4/11.0 MB 1.3 MB/s eta 0:00:07
   ---------- ----------------------------- 2.9/11.0 MB 1.4 MB/s eta 0:00:06
   ----------- ---------------------------- 3.1/11.0 MB 1.4 MB/s eta 0:00:06
   ------------- -------------------------- 3.7/11.0 MB 1.5 MB/s eta 0:00:06
   -------------- ------------------------- 3.9/11.0 MB 1.5 MB/s eta 0:00:05
   --------------- ------------------------ 4.2/11.0 MB 1.5 MB/s eta 0:00:05
   ------------------ --------------------- 5.0/11.0 MB 1.5 MB/s eta 0:00:04
   -------------------- ------------------- 5.5/11.0 MB 1.6 MB/s eta 0:00:04
   -------------------- ------------------- 5.8/11.0 MB 1.6 MB/s eta 0:00:04
   --------------------- ------------------ 6.0/11.0 MB 1.6 MB/s eta 0:00:04
   ----------------------- ---------------- 6.6/11.0 MB 1.7 MB/s eta 0:00:03
   -------------------------- ------------- 7.3/11.0 MB 1.7 MB/s eta 0:00:03
   ---------------------------- ----------- 7.9/11.0 MB 1.8 MB/s eta 0:00:02
   ------------------------------- -------- 8.7/11.0 MB 1.9 MB/s eta 0:00:02
   ---------------------------------- ----- 9.4/11.0 MB 2.0 MB/s eta 0:00:01
   ---------------------------------- ----- 9.4/11.0 MB 2.0 MB/s eta 0:00:01
   ------------------------------------- -- 10.2/11.0 MB 1.9 MB/s eta 0:00:01
   ---------------------------------------  10.7/11.0 MB 2.0 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 2.0 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.3
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: C:\Users\marre\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd
import numpy as np

In [6]:
l = ['a', 'b', 'c']
n = [1, 2, 3]
d = {'a': 1, 'b': 2, 'c': 3}
my_arr = np.array(n)
print(my_arr)

[1 2 3]

In [7]:
pd.Series(n)

0    1
1    2
2    3
dtype: int64

In [8]:
pd.Series(data = n, index = l)

a    1
b    2
c    3
dtype: int64

In [9]:
pd.Series(my_arr)

0    1
1    2
2    3
dtype: int64

In [10]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

1.2. Series Attributes and Indexing

In [12]:
s = pd.Series(data = [111, 222, 333, 444], index = ['a', 'b', 'c', 'd'], name='MySeries')

In [13]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [14]:
s.name

'MySeries'

In [15]:
s.dtype

dtype('int64')

In [16]:
s.values

array([111, 222, 333, 444])

In [17]:
s[0]

C:\Users\marre\AppData\Local\Temp\ipykernel_20304\243613605.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

np.int64(111)

In [18]:
s['b']

np.int64(222)

In [19]:
s[2:4]

c    333
d    444
Name: MySeries, dtype: int64

In [20]:
s['c']

np.int64(333)

In [21]:
s['d']

np.int64(444)

In [22]:
s[['a', 'c']]

a    111
c    333
Name: MySeries, dtype: int64

In [23]:
s[['a', 'b', 'c']]

a    111
b    222
c    333
Name: MySeries, dtype: int64

1.3 Series Operations

In [24]:
s1 = pd.Series(data = [1, 2, 3, 4], index = ['d', 'b', 'c', 'a'])
s2 = pd.Series(data = [1, 2, 3, 4], index = ['a', 'b', 'd', 'e'])
print(s1)
print(s2)

d    1
b    2
c    3
a    4
dtype: int64
a    1
b    2
d    3
e    4
dtype: int64

In [25]:
s1 + s2

a    5.0
b    4.0
c    NaN
d    4.0
e    NaN
dtype: float64

In [26]:
s1 - s2

a    3.0
b    0.0
c    NaN
d   -2.0
e    NaN
dtype: float64

In [27]:
s1 * s2

a    4.0
b    4.0
c    NaN
d    3.0
e    NaN
dtype: float64

In [28]:
s1 / s2

a    4.000000
b    1.000000
c         NaN
d    0.333333
e         NaN
dtype: float64

In [29]:
s1 // s2

a    4.0
b    1.0
c    NaN
d    0.0
e    NaN
dtype: float64

In [30]:
2*s1

d    2
b    4
c    6
a    8
dtype: int64

In [31]:
3*s2

a     3
b     6
d     9
e    12
dtype: int64

1.4 Series Methods

In [32]:
s1.sum()

np.int64(10)

In [33]:
s1.mean()

np.float64(2.5)

In [34]:
s2.median()

np.float64(2.5)

In [35]:
s1.sort_values()

d    1
b    2
c    3
a    4
dtype: int64

In [37]:
s1.max()

np.int64(4)

In [38]:
s1.std()

np.float64(1.2909944487358056)

In [39]:
s1.sort_index()

a    4
b    2
c    3
d    1
dtype: int64

In [40]:
ser_height = pd.Series([165.3, 170.1, 175.0, 182.1, 168.0, 162.0, 150.6, 167.1, 180.0, 162.2, 169.2, 152.8, 165.9], name = "height")

In [41]:
print(ser_height)

0     165.3
1     170.1
2     175.0
3     182.1
4     168.0
5     162.0
6     150.6
7     167.1
8     180.0
9     162.2
10    169.2
11    152.8
12    165.9
Name: height, dtype: float64

In [42]:
ser_height.apply(lambda x: x/100)

0     1.653
1     1.701
2     1.750
3     1.821
4     1.680
5     1.620
6     1.506
7     1.671
8     1.800
9     1.622
10    1.692
11    1.528
12    1.659
Name: height, dtype: float64

In [44]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
print(obj1)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [46]:
states = ['California', 'Ohio', 'Oregon', 'Texas', 'Utah']
obj2 = pd.Series(sdata, index = states)
print(obj2)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
dtype: float64

In [47]:
pd.isnull(obj1)

Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

In [48]:
pd.isnull(obj2)

California     True
Ohio          False
Oregon        False
Texas         False
Utah          False
dtype: bool

In [49]:
pd.notnull(obj2)

California    False
Ohio           True
Oregon         True
Texas          True
Utah           True
dtype: bool

In [50]:
obj2.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
Utah          False
dtype: bool

In [51]:
obj2.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
Utah           True
dtype: bool

In [52]:
obj1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [53]:
obj2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
dtype: float64

In [54]:
obj1 + obj2

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah           10000.0
dtype: float64

In [55]:
obj2.name = 'population'
obj2.index.name = 'states'
print(obj2)

states
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah           5000.0
Name: population, dtype: float64

In [56]:
obj1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [57]:
obj1.index = ['Bob', 'Jeff', 'Mark', 'John']

In [58]:
obj1

Bob     35000
Jeff    71000
Mark    16000
John     5000
dtype: int64

DataFrame

In [59]:
import os

In [60]:
data = {'NAME': ['Jake', 'Jennifer', 'Paul', 'Andrew'], 'AGE': [24, 21, 25, 19], 'GENDER': ['M', 'F', 'M', 'M']}
df = pd.DataFrame(data)
print(df)

       NAME  AGE GENDER
0      Jake   24      M
1  Jennifer   21      F
2      Paul   25      M
3    Andrew   19      M

In [63]:
df = pd.DataFrame(np.random.rand(10, 5), columns=['A', 'B', 'C', 'D', 'E'])
df

          A         B         C         D         E
0  0.963313  0.930806  0.969236  0.672881  0.295691
1  0.778801  0.497383  0.682729  0.250111  0.323344
2  0.884967  0.331964  0.767766  0.895898  0.316756
3  0.303850  0.729983  0.465116  0.701372  0.926359
4  0.358405  0.770130  0.953089  0.611588  0.380608
5  0.055364  0.025264  0.914364  0.390632  0.997493
6  0.918573  0.653001  0.463530  0.213986  0.617346
7  0.747915  0.843768  0.435518  0.553648  0.262944
8  0.087923  0.935760  0.755252  0.609166  0.277303
9  0.156756  0.661647  0.088251  0.104888  0.219283

In [66]:
df.head(3)

          A         B         C         D         E
0  0.963313  0.930806  0.969236  0.672881  0.295691
1  0.778801  0.497383  0.682729  0.250111  0.323344
2  0.884967  0.331964  0.767766  0.895898  0.316756

In [67]:
df.tail(3)

          A         B         C         D         E
7  0.747915  0.843768  0.435518  0.553648  0.262944
8  0.087923  0.935760  0.755252  0.609166  0.277303
9  0.156756  0.661647  0.088251  0.104888  0.219283

In [68]:
os.chdir(r"D:\IARE\6th Semester\SamsungInnovation")

In [71]:
df = pd.read_csv("08. data_studentlist.csv", header = 'infer')
df

                name gender  age  grade absence bloodtype  height  weight
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [72]:
df.shape

(17, 8)

In [73]:
df.size

136

In [74]:
df.ndim

2

In [75]:
df.columns

Index(['name', 'gender', 'age', 'grade', 'absence', 'bloodtype', 'height',
       'weight'],
      dtype='object')

In [76]:
df.index

RangeIndex(start=0, stop=17, step=1)

In [77]:
type(df)

pandas.core.frame.DataFrame

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       17 non-null     object
 1   gender     17 non-null     object
 2   age        17 non-null     int64
 3   grade      17 non-null     int64
 4   absence    17 non-null     object
 5   bloodtype  17 non-null     object
 6   height     17 non-null     float64
 7   weight     17 non-null     float64
dtypes: float64(2), int64(2), object(4)
memory usage: 1.2+ KB

In [80]:
df.describe()

             age      grade      height     weight
count  17.000000  17.000000   17.000000  17.000000
mean   22.352941   2.294118  170.035294  61.064706
std     1.169464   1.104802    7.849756  11.851685
min    20.000000   1.000000  155.200000  45.200000
25%    22.000000   1.000000  165.300000  53.000000
50%    22.000000   2.000000  169.200000  61.300000
75%    23.000000   3.000000  176.100000  68.200000
max    24.000000   4.000000  182.100000  85.700000

In [81]:
df.head(5)

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [82]:
df.head()

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [83]:
df.tail()

                name gender  age  grade absence bloodtype  height  weight
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [84]:
header = df.columns
header

Index(['name', 'gender', 'age', 'grade', 'absence', 'bloodtype', 'height',
       'weight'],
      dtype='object')

In [86]:
df.columns = ['NAME', 'GENDER', 'AGE', 'GRADE', 'ABSENCE', 'BLOODTYPE', 'HEIGHT', 'WEIGHT']
print(df.head(3))

             NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0   Jared Diamond      M   23      3       Y         O   165.3    68.2
1  Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2    Brian Martin      M   24      4       N         B   175.0    80.1

In [87]:
df.NAME

0        Jared Diamond
1       Sarah O'Donnel
2         Brian Martin
3         David Hassel
4      Clara Rodriquez
5     Jennifer Lorentz
6          Susan Clark
7      Margareth Jones
8         John Bertsch
9       Jake Timmerman
10       Joshua Connor
11        John Matsuda
12        Eddy Johnson
13    Rebecah Anderson
14        Linda Carter
15      Richard Swayze
16         Andrew King
Name: NAME, dtype: object

In [88]:
df.AGE

0     23
1     22
2     24
3     23
4     20
5     21
6     22
7     23
8     23
9     22
10    24
11    22
12    21
13    23
14    22
15    24
16    21
Name: AGE, dtype: int64

In [89]:
type(df.NAME)

pandas.core.series.Series

In [90]:
df['NAME']

0        Jared Diamond
1       Sarah O'Donnel
2         Brian Martin
3         David Hassel
4      Clara Rodriquez
5     Jennifer Lorentz
6          Susan Clark
7      Margareth Jones
8         John Bertsch
9       Jake Timmerman
10       Joshua Connor
11        John Matsuda
12        Eddy Johnson
13    Rebecah Anderson
14        Linda Carter
15      Richard Swayze
16         Andrew King
Name: NAME, dtype: object

In [91]:
type(df['NAME'])

pandas.core.series.Series

In [94]:
df[['NAME']]
# This is a dataframe with one column

                NAME
0      Jared Diamond
1     Sarah O'Donnel
2       Brian Martin
3       David Hassel
4    Clara Rodriquez
5   Jennifer Lorentz
6        Susan Clark
7    Margareth Jones
8       John Bertsch
9     Jake Timmerman
10     Joshua Connor
11      John Matsuda
12      Eddy Johnson
13  Rebecah Anderson
14      Linda Carter
15    Richard Swayze
16       Andrew King

In [95]:
type(df[['NAME']])

pandas.core.frame.DataFrame

In [96]:
df.loc[:, 'NAME']

0        Jared Diamond
1       Sarah O'Donnel
2         Brian Martin
3         David Hassel
4      Clara Rodriquez
5     Jennifer Lorentz
6          Susan Clark
7      Margareth Jones
8         John Bertsch
9       Jake Timmerman
10       Joshua Connor
11        John Matsuda
12        Eddy Johnson
13    Rebecah Anderson
14        Linda Carter
15      Richard Swayze
16         Andrew King
Name: NAME, dtype: object

In [97]:
df.loc[:, ['NAME', 'GENDER']]

                NAME GENDER
0      Jared Diamond      M
1     Sarah O'Donnel      F
2       Brian Martin      M
3       David Hassel      M
4    Clara Rodriquez      F
5   Jennifer Lorentz      F
6        Susan Clark      F
7    Margareth Jones      F
8       John Bertsch      M
9     Jake Timmerman      M
10     Joshua Connor      M
11      John Matsuda      M
12      Eddy Johnson      M
13  Rebecah Anderson      F
14      Linda Carter      F
15    Richard Swayze      M
16       Andrew King      M

In [100]:
df.iloc[:, [0, 1]] # Integer indexing in iloc

                NAME GENDER
0      Jared Diamond      M
1     Sarah O'Donnel      F
2       Brian Martin      M
3       David Hassel      M
4    Clara Rodriquez      F
5   Jennifer Lorentz      F
6        Susan Clark      F
7    Margareth Jones      F
8       John Bertsch      M
9     Jake Timmerman      M
10     Joshua Connor      M
11      John Matsuda      M
12      Eddy Johnson      M
13  Rebecah Anderson      F
14      Linda Carter      F
15    Richard Swayze      M
16       Andrew King      M

In [103]:
header = df.columns
df.loc[:, (header == 'NAME') | (header == 'GENDER')]

                NAME GENDER
0      Jared Diamond      M
1     Sarah O'Donnel      F
2       Brian Martin      M
3       David Hassel      M
4    Clara Rodriquez      F
5   Jennifer Lorentz      F
6        Susan Clark      F
7    Margareth Jones      F
8       John Bertsch      M
9     Jake Timmerman      M
10     Joshua Connor      M
11      John Matsuda      M
12      Eddy Johnson      M
13  Rebecah Anderson      F
14      Linda Carter      F
15    Richard Swayze      M
16       Andrew King      M

In [ ]:
df.loc[:, (header == 'NAME') & (header == 'GENDER')]
# Doesn't work as expected or taught

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]

In [106]:
df.loc[2]

NAME         Brian Martin
GENDER                  M
AGE                    24
GRADE                   4
ABSENCE                 N
BLOODTYPE               B
HEIGHT              175.0
WEIGHT               80.1
Name: 2, dtype: object

In [107]:
df.head()

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [ ]:
df.loc[2:4] # Stop is inclusive

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [ ]:
df.iloc[2:4] # Stop is exclusive

           NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
2  Brian Martin      M   24      4       N         B   175.0    80.1
3  David Hassel      M   23      3       N        AB   182.1    85.7

In [112]:
df.drop(columns = ['NAME', 'GENDER'])
# To drop the rows in real-time, use inplace = True parameter, this is just a view

    AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    23      3       Y         O   165.3    68.2
1    22      2       N        AB   170.1    53.0
2    24      4       N         B   175.0    80.1
3    23      3       N        AB   182.1    85.7
4    20      1       Y         A   168.0    49.5
5    21      2       N         O   162.0    52.0
6    22      1       N         O   155.2    45.3
7    23      1       N         A   176.9    55.0
8    23      3       N         B   178.5    64.2
9    22      2       N         B   176.1    61.3
10   24      4       Y         O   167.1    62.0
11   22      2       N        AB   180.0    75.8
12   21      1       N         A   162.2    55.3
13   23      3       N         O   176.1    53.1
14   22      2       N         B   158.2    45.2
15   24      4       Y         B   168.6    70.2
16   21      1       N         A   169.2    62.2

In [113]:
df

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [114]:
header = df.columns
df.loc[:, (header != 'NAME') & (header != 'GENDER')]

    AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    23      3       Y         O   165.3    68.2
1    22      2       N        AB   170.1    53.0
2    24      4       N         B   175.0    80.1
3    23      3       N        AB   182.1    85.7
4    20      1       Y         A   168.0    49.5
5    21      2       N         O   162.0    52.0
6    22      1       N         O   155.2    45.3
7    23      1       N         A   176.9    55.0
8    23      3       N         B   178.5    64.2
9    22      2       N         B   176.1    61.3
10   24      4       Y         O   167.1    62.0
11   22      2       N        AB   180.0    75.8
12   21      1       N         A   162.2    55.3
13   23      3       N         O   176.1    53.1
14   22      2       N         B   158.2    45.2
15   24      4       Y         B   168.6    70.2
16   21      1       N         A   169.2    62.2

In [115]:
# Conditional Slicing
df[df.GENDER == 'M']

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
8     John Bertsch      M   23      3       N         B   178.5    64.2
9   Jake Timmerman      M   22      2       N         B   176.1    61.3
10   Joshua Connor      M   24      4       Y         O   167.1    62.0
11    John Matsuda      M   22      2       N        AB   180.0    75.8
12    Eddy Johnson      M   21      1       N         A   162.2    55.3
15  Richard Swayze      M   24      4       Y         B   168.6    70.2
16     Andrew King      M   21      1       N         A   169.2    62.2

In [116]:
df[df.GENDER != 'M']

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2

In [118]:
df[-(df.GENDER == 'M')]

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2

In [119]:
df[~(df.GENDER == 'M')]

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2

In [120]:
df[df.GENDER == 'F']

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2

In [121]:
df.loc[df.HEIGHT > 170, 'HEIGHT']

1     170.1
2     175.0
3     182.1
7     176.9
8     178.5
9     176.1
11    180.0
13    176.1
Name: HEIGHT, dtype: float64

In [123]:
df[(df.WEIGHT > 70) & (df.WEIGHT < 80)]

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
11    John Matsuda      M   22      2       N        AB   180.0    75.8
15  Richard Swayze      M   24      4       Y         B   168.6    70.2

In [125]:
df[(df.GENDER == 'M') & (df.AGE > 20)]

              NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
8     John Bertsch      M   23      3       N         B   178.5    64.2
9   Jake Timmerman      M   22      2       N         B   176.1    61.3
10   Joshua Connor      M   24      4       Y         O   167.1    62.0
11    John Matsuda      M   22      2       N        AB   180.0    75.8
12    Eddy Johnson      M   21      1       N         A   162.2    55.3
15  Richard Swayze      M   24      4       Y         B   168.6    70.2
16     Andrew King      M   21      1       N         A   169.2    62.2

In [126]:
df[~((df.GENDER == 'M') & (df.HEIGHT > 175))]

                NAME GENDER  AGE  GRADE ABSENCE BLOODTYPE  HEIGHT  WEIGHT
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [127]:
df2 = df.drop(columns = ['GRADE', 'ABSENCE'])
print(df2)

                NAME GENDER  AGE BLOODTYPE  HEIGHT  WEIGHT
0      Jared Diamond      M   23         O   165.3    68.2
1     Sarah O'Donnel      F   22        AB   170.1    53.0
2       Brian Martin      M   24         B   175.0    80.1
3       David Hassel      M   23        AB   182.1    85.7
4    Clara Rodriquez      F   20         A   168.0    49.5
5   Jennifer Lorentz      F   21         O   162.0    52.0
6        Susan Clark      F   22         O   155.2    45.3
7    Margareth Jones      F   23         A   176.9    55.0
8       John Bertsch      M   23         B   178.5    64.2
9     Jake Timmerman      M   22         B   176.1    61.3
10     Joshua Connor      M   24         O   167.1    62.0
11      John Matsuda      M   22        AB   180.0    75.8
12      Eddy Johnson      M   21         A   162.2    55.3
13  Rebecah Anderson      F   23         O   176.1    53.1
14      Linda Carter      F   22         B   158.2    45.2
15    Richard Swayze      M   24         B   168.6    70.2
16       Andrew King      M   21         A   169.2    62.2

In [128]:
df2.to_csv('data_mine.csv', index = False)

In [130]:
df3 = pd.read_csv('data_mine.csv', encoding = 'latin1', header = 'infer')
df3

                NAME GENDER  AGE BLOODTYPE  HEIGHT  WEIGHT
0      Jared Diamond      M   23         O   165.3    68.2
1     Sarah O'Donnel      F   22        AB   170.1    53.0
2       Brian Martin      M   24         B   175.0    80.1
3       David Hassel      M   23        AB   182.1    85.7
4    Clara Rodriquez      F   20         A   168.0    49.5
5   Jennifer Lorentz      F   21         O   162.0    52.0
6        Susan Clark      F   22         O   155.2    45.3
7    Margareth Jones      F   23         A   176.9    55.0
8       John Bertsch      M   23         B   178.5    64.2
9     Jake Timmerman      M   22         B   176.1    61.3
10     Joshua Connor      M   24         O   167.1    62.0
11      John Matsuda      M   22        AB   180.0    75.8
12      Eddy Johnson      M   21         A   162.2    55.3
13  Rebecah Anderson      F   23         O   176.1    53.1
14      Linda Carter      F   22         B   158.2    45.2
15    Richard Swayze      M   24         B   168.6    70.2
16       Andrew King      M   21         A   169.2    62.2

In [131]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: C:\Users\marre\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [132]:
os.getcwd()

'D:\\IARE\\6th Semester\\SamsungInnovation'

In [137]:
pip install xlrd

Defaulting to user installation because normal site-packages is not writeable
Collecting xlrd
  Downloading xlrd-2.0.2-py2.py3-none-any.whl.metadata (3.5 kB)
Downloading xlrd-2.0.2-py2.py3-none-any.whl (96 kB)
Installing collected packages: xlrd
Successfully installed xlrd-2.0.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: C:\Users\marre\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [138]:
dfx = pd.read_excel('data_studentlist.xls')
dfx

                name gender  age  grade absence bloodtype  height  weight
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [ ]:
dfx.to_excel('data_studentslist2.xlsx', sheet_name='NewSheet', index = False)

In [142]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2003, 2002, 2001], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3    Ohio  2003  2.4
4  Nevada  2002  2.9
5  Nevada  2001  3.2